/****** Script for SelectTopNRows command from SSMS  ******/
SELECT TOP (1000) [id]
      ,[question]
      ,[e1]
      ,[e2]
      ,[e3]
      ,[e4]
      ,[r]
      ,[img]
  FROM [teoryB].[dbo].[questionArr]

    insert into questionArr(
   [id]
      ,[question]
      ,[e1]
      ,[e2]
      ,[e3]
      ,[e4]
      ,[r]
      ,[img])
	   values   (1,'באילו מקרים חייב הנוהג ברכב מנועי לעמעם את אורותיו?','כאשר הרכב עומד.','בעת חיפוש אחרי מקום חנייה.','בכניסה לחצרים.','בנסיעה לאחור.',4,null)

    insert into questionArr(
   [id]
      ,[question]
      ,[e1]
      ,[e2]
      ,[e3]
      ,[e4]
      ,[r]
      ,[img])
	   values  (2,'באילו מקרים מותר לנהוג ברכב בירידה בהילוך סרק (ניוטרל)?','אסור בכל מקרה. בנהיגה בירידה אחד ההילוכים חייב להיות משולב ומופעל.','בדרך שאינה עירונית שיש בה ירידות מתונות מותר לשלב להילוך סרק כדי לחסוך בדלק.','בירידה מתונה שאין בה סכנה של חימום הבלמים אפשר לנהוג בהילוך סרק כדי לחסוך בדלק.','ברכב ציבורי, באוטובוס ובמונית מותר לשלב להילוך סרק בירידה בדרך שאינה עירונית בלבד.',4,null)

	      insert into questionArr(
   [id]
      ,[question]
      ,[e1]
      ,[e2]
      ,[e3]
      ,[e4]
      ,[r]
      ,[img])
	   values  (3,'הצומת שלפניך מתומרר בדיוק כבציור. מהו האופן הנכון לפנות מרחוב א (A) לרחוב ג (C)?','מנתיב 2 לנתיב 3.','מנתיב 2 לנתיב 3 או לנתיב 4.','מנתיב 2 או מנתיב 1 לנתיב 3.','מנתיב 2 או מנתיב 1 לנתיב 3 או לנתיב 4.',4,'https://noeg.co.il/theory/i3110.jpg')

	  DELETE FROM questionArr
      WHERE id=4